{
  "backend/main.mo": "Motoko canister defining user, business, customer, item, invoice, and GST filing data models with storage maps and access control mixins.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, titles, associated files, components, and test references for recent fixes and UI changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components, pages, utilities, and PWA files.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables, light/dark themes, and base UI styling.",
  "frontend/index.html": "Main HTML entry file configuring meta tags, PWA manifest, icons, and extensive iOS splash screen assets.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, icons, and launch behavior for GST Pro.",
  "frontend/public/sw.js": "Service worker caching static assets, cleaning old caches, and handling fetch requests with network-first or cache-first strategies.",
  "frontend/SMOKE_TEST.md": "Manual smoke-test checklist outlining authentication, admin panel, and user-management test steps after deployment.",
  "frontend/src/App.tsx": "Main app root configuring React Query, router, themes, service worker registration, and global error boundary.",
  "frontend/src/components/admin/AddUserDialog.tsx": "Dialog for admins to create new users with email, password, mobile, role, and optional access expiry.",
  "frontend/src/components/admin/AdminCredentialLoginForm.tsx": "Admin login form that authenticates via user ID and password, handling validation and error display.",
  "frontend/src/components/admin/AdminOnlyGate.tsx": "Gates content behind an admin check, showing loading and unauthorized states as needed.",
  "frontend/src/components/admin/AdminPortalLayout.tsx": "Layout wrapper for admin pages with optional back navigation and a title header.",
  "frontend/src/components/admin/CreateCredentialDialog.tsx": "Empty placeholder file for a credential creation dialog.",
  "frontend/src/components/admin/CredentialsTable.tsx": "Empty placeholder file intended for listing and managing credentials.",
  "frontend/src/components/admin/ResetPasswordDialog.tsx": "Empty placeholder file for a password reset dialog.",
  "frontend/src/components/admin/RevokeCredentialDialog.tsx": "Empty placeholder file for revoking user credentials.",
  "frontend/src/components/admin/SetAccessUntilDialog.tsx": "Dialog allowing admins to set or clear a user's access expiry timestamp with validation and mutation handling.",
  "frontend/src/components/admin/SetCredentialRoleDialog.tsx": "Empty placeholder file for modifying a credential’s role.",
  "frontend/src/components/admin/UsersTable.tsx": "Displays all users with actions for viewing dashboards, deleting users, and managing access expiry.",
  "frontend/src/components/AppAccessGate.tsx": "No-op wrapper component that always renders children; access control disabled for version 9.",
  "frontend/src/components/AppAccessLoginForm.tsx": "Deprecated login form UI kept for compatibility, instructing users to sign in via Internet Identity.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary catching rendering errors and displaying a fallback screen.",
  "frontend/src/components/AppShell.tsx": "Top-level layout with header, navigation, footer, and logo branding for the main application.",
  "frontend/src/components/auth/CredentialSignInForm.tsx": "Provides a credential-based sign‑in form with client-side validation and mutation handling for email/password login.",
  "frontend/src/components/auth/SignUpDialog.tsx": "Implements a modal dialog for user sign‑up with validation, error display, success message handling, and form reset logic.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard handling Internet Identity login, credential login UI, and loading or sign‑in screens.",
  "frontend/src/components/customers/CustomerFormDialog.tsx": "Modal form for adding or editing customers, syncing form state, validating input, and calling backend mutations.",
  "frontend/src/components/customers/CustomersTable.tsx": "Displays a customer list with edit/delete actions, delete confirmation, and loading/empty states.",
  "frontend/src/components/ErrorFallbackScreen.tsx": "Fallback UI for unhandled errors with reload and optional sign‑in actions.",
  "frontend/src/components/FirstAdminSetupDialog.tsx": "Empty placeholder file for first‑admin setup dialog.",
  "frontend/src/components/forms/ScrollableSelectContent.tsx": "Wraps SelectContent to enforce consistent scroll behavior with a max height and iOS-friendly scrolling.",
  "frontend/src/components/gst/GstProfileSection.tsx": "Renders GST profile details and status badges from filing status data in a structured card layout.",
  "frontend/src/components/invoices/InvoiceLineItemsEditor.tsx": "Editor component for managing invoice line items, allowing item selection, quantity/price updates, and row add/remove actions.",
  "frontend/src/components/invoices/InvoiceStatusBadge.tsx": "Renders a status badge for an invoice based on its status enum.",
  "frontend/src/components/invoices/MonthlyInvoiceSummary.tsx": "Generates monthly aggregated invoice totals and displays them in a card and table layout with optional filtering.",
  "frontend/src/components/items/ItemFormDialog.tsx": "Dialog form for creating or editing an item with validation and submit handlers.",
  "frontend/src/components/items/ItemsTable.tsx": "Displays a table of items with edit and delete actions and handles delete confirmation.",
  "frontend/src/components/LoginButton.tsx": "Handles sign‑in and sign‑out actions with Internet Identity and updates app/auth state.",
  "frontend/src/components/MobileNav.tsx": "Mobile navigation drawer with links and an external E‑Way Bill shortcut.",
  "frontend/src/components/PrintLayout.tsx": "Minimal authenticated layout for print views including profile setup.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new users for their name and saves it via a profile mutation, showing a dialog only when no profile exists.",
  "frontend/src/components/pwa/IosInstallHelpDialog.tsx": "Dialog showing step-by-step instructions for installing the app on iOS.",
  "frontend/src/components/pwa/PwaInstallFooterSection.tsx": "Footer section offering PWA installation options for Android and iOS, including dialogs and install prompts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminCredentialSignIn.ts": "Provides a mutation for admin credential authentication using the current actor and refreshes admin status.",
  "frontend/src/hooks/useAdminUserDashboard.ts": "Fetches user invoice KPIs and retrieves user details from the users list for admin dashboards.",
  "frontend/src/hooks/useAdminUsers.ts": "Admin utilities for listing, creating, deleting users, setting access expiry, and fetching all user types.",
  "frontend/src/hooks/useBackendReady.ts": "Checks if the backend actor is ready and returns readiness state with a helper message.",
  "frontend/src/hooks/useCredentialSignIn.ts": "Handles user sign‑in via Internet Identity plus credential authentication and refreshes all queries on success.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller’s user profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading, login, logout, and identity management via AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current user is an admin with caching and loading-state helpers.",
  "frontend/src/hooks/usePrintOnce.ts": "Triggers window.print once when ready and optionally runs a callback after printing.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA installability, handles beforeinstallprompt events, and exposes an install prompt function.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for loading and mutating user, business, and customer data via the backend actor, with cache updates and validation.",
  "frontend/src/hooks/useRecordInternetIdentitySignIn.ts": "Defines a helper hook that retries until the actor is available and then logs Internet Identity sign‑in events without blocking UI flow.",
  "frontend/src/hooks/useSafeInternetIdentityLogin.ts": "Implements a safe login wrapper that retries after clearing stale Internet Identity sessions and exposes login state flags.",
  "frontend/src/hooks/useSignUp.ts": "Exports a mutation hook that calls the backend to register a new user with email, password, and mobile credentials.",
  "frontend/src/index.css": "Global TailwindCSS styles defining theme variables, dark mode, safe‑area handling, mobile touch improvements, and print‑friendly rules.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin login flow for non‑admin users and the admin management interface for authorized users.",
  "frontend/src/pages/AdminUserDashboardPage.tsx": "Displays an admin‑only dashboard with user details, sign‑in info, and invoice KPI statistics.",
  "frontend/src/pages/CustomersPage.tsx": "Shows a searchable customers list with error handling and dialogs for adding or editing customer records.",
  "frontend/src/pages/DashboardPage.tsx": "Displays overview KPIs for invoices, customers, items, and GST totals, with navigation to invoice creation and setup prompts.",
  "frontend/src/pages/GstFilingStatusPage.tsx": "Fetches and displays GST filing status for a GSTIN with filters for FY, return type, and frequency, including search and refresh actions.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Shows detailed invoice info, totals, and actions like edit, finalize, cancel, delete, or print.",
  "frontend/src/pages/InvoiceEditorPage.tsx": "Form for creating or editing invoices with customer selection, line items, totals calculation, and save logic.",
  "frontend/src/pages/InvoicePrintPage.tsx": "Generates a printable invoice layout with tax breakdown, totals, banking details, and auto-triggered print behavior.",
  "frontend/src/pages/InvoicesPage.tsx": "Invoices list page with filters for status, date, year, and month, plus loading state and navigation to invoice actions.",
  "frontend/src/pages/ItemsPage.tsx": "Provides item search, listing, and create/edit dialog handling with error display.",
  "frontend/src/pages/SettingsPage.tsx": "Business profile settings form with logo upload, validation, and backend save integration.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and logs update availability.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route tree including layouts, main app pages, print pages, and admin routes.",
  "frontend/src/utils/adminTimeFormat.ts": "Utility functions to convert backend nanosecond timestamps to readable date/time strings and back.",
  "frontend/src/utils/amountInWordsINR.ts": "Converts numeric rupee amounts into Indian English words using crore/lakh grouping.",
  "frontend/src/utils/appAccessStorage.ts": "LocalStorage helpers for deprecated per‑principal app access state management.",
  "frontend/src/utils/dateFormat.ts": "Utilities for formatting invoice dates and extracting year/month values.",
  "frontend/src/utils/financialYears.ts": "Generates a list of recent Indian financial year strings based on the current date.",
  "frontend/src/utils/formatters.ts": "Formats numbers as INR currency using Indian locale rules.",
  "frontend/src/utils/gstCalculations.ts": "Computes invoice totals including GST, discounts, and inter/intra‑state tax split, with helpers for formatting and invoice-based calculation.",
  "frontend/src/utils/gstFilingStatusDisplay.ts": "Normalizes GST filing status strings into consistent labels and returns display variants for badges.",
  "frontend/src/utils/indianStates.ts": "Exports a constant list of all Indian states and union territories.",
  "frontend/src/utils/invoiceNumbering.ts": "Generates formatted invoice numbers using business profile settings and falls back to stored invoice numbers when available.",
  "frontend/src/utils/invoiceRules.ts": "Allows all invoices to be deleted and returns a fixed error message for deletion failures.",
  "frontend/src/utils/invoiceTaxBreakdown.ts": "Builds HSN/SAC‑grouped GST tax breakdowns for invoices and computes totals based on inter/intra‑state rules.",
  "frontend/src/utils/passwordHash.ts": "Empty placeholder file for password hashing utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash‑based routing parameters.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into cleaned, user‑friendly messages with special handling for auth, network, and GST errors.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, layouts, animations, and plugin setup.",
  "project_state.json": "JSON describing the project's current state, known issues, architecture notes, and version metadata."
}