{
  "backend/main.mo": "Motoko canister implementing user-scoped GST billing data with profiles, business info, customers, items, invoices, and access control checks.",
  "feature_evidence.json": "JSON report mapping features to related frontend files, components, and test IDs for the GST Pro app.",
  "frontend-file-summaries.txt": "Contains a brief summary of ProfileSetupDialog.tsx explaining the dialog behavior and prop fix.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "Base HTML file that loads the GST Pro React app and mounts it at the root element.",
  "frontend/src/App.tsx": "Initializes React Query and router, wraps the app in a theme provider, and mounts global UI components.",
  "frontend/src/components/AppShell.tsx": "Layout shell providing navigation, header, mobile sidebar, and authentication‑aware UI for the app.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that blocks content until the user is authenticated via Internet Identity.",
  "frontend/src/components/customers/CustomerFormDialog.tsx": "Dialog form for adding or editing customers, handling validation, mutation calls, and toast notifications.",
  "frontend/src/components/customers/CustomersTable.tsx": "Displays a customer list with edit and delete actions, including a confirmation dialog and loading/empty states.",
  "frontend/src/components/invoices/InvoiceLineItemsEditor.tsx": "Interactive table for managing invoice line items, allowing item selection, quantity/price updates, and row add/remove.",
  "frontend/src/components/invoices/InvoiceStatusBadge.tsx": "Shows a badge indicating whether an invoice is in draft or finalized status.",
  "frontend/src/components/items/ItemFormDialog.tsx": "Dialog form for creating or editing items with validation, mutation calls, and success/error toasts.",
  "frontend/src/components/items/ItemsTable.tsx": "Renders a list of items with edit and delete options, plus loading and empty-state messaging.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and React Query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting first‑time users to enter and save their profile name before proceeding.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user's profile using the backend actor with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on business profiles, customers, items, and invoices via an actor interface.",
  "frontend/src/index.css": "Configures Tailwind CSS layers, theme variables, dark mode styles, and print-specific overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/CustomersPage.tsx": "Displays a searchable customer list with add and edit functionality using a table and form dialog.",
  "frontend/src/pages/DashboardPage.tsx": "Shows invoice stats, business setup status, and quick actions on the main dashboard.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Loads and displays detailed invoice info with totals and actions for editing, finalizing, deleting, and printing.",
  "frontend/src/pages/InvoiceEditorPage.tsx": "Invoice creation/edit page that loads data, manages form state, calculates totals, and saves invoices.",
  "frontend/src/pages/InvoicePrintPage.tsx": "Print-friendly invoice view that loads invoice data, calculates totals, and triggers browser print.",
  "frontend/src/pages/InvoicesPage.tsx": "Lists invoices with customer names, statuses, actions, and navigation to create or view invoices.",
  "frontend/src/pages/ItemsPage.tsx": "Displays searchable list of items and opens a dialog for creating or editing item entries.",
  "frontend/src/pages/SettingsPage.tsx": "Form for viewing and updating business profile and invoice numbering settings.",
  "frontend/src/routeTree.tsx": "Defines the application's route structure and maps pages to their URL paths.",
  "frontend/src/utils/formatters.ts": "Provides a helper for formatting numbers as INR currency.",
  "frontend/src/utils/gstCalculations.ts": "Computes invoice totals including discounts, GST breakdowns, and inter/intra-state logic.",
  "frontend/src/utils/invoiceNumbering.ts": "Formats invoice numbers using business profile prefix and starting sequence.",
  "frontend/src/utils/invoiceRules.ts": "Contains rules for determining invoice deletability and related error messaging.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores the project’s state, including GST Pro feature requirements, versions, and image needs."
}