{
  "backend/main.mo": "Defines the main canister with user, business, customer, item, and invoice data models, storage maps, and authorization/storage mixins. Adds bill-to and ship-to override fields and GST filing-related types.",
  "backend/migration.mo": "Migration module converting old invoices to new invoices by adding bill-to and ship-to override fields initialized to null. Transforms invoicesByUser maps to the updated structure.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, and test IDs for invoice address overrides, print updates, and layout fixes.",
  "frontend-file-summaries.txt": "Contains short summaries of many frontend components, describing their responsibilities such as dialogs, editors, pages, PWA setup, and print CSS improvements.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, theming variables, dark mode values, and applying base layout rules.",
  "frontend/index.html": "Main HTML entry file configuring PWA metadata, icons, and splash screens for various devices.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, start URL, display mode, colors, and icons.",
  "frontend/public/sw.js": "Service worker implementing caching strategies for static assets and navigation requests.",
  "frontend/SMOKE_TEST.md": "Manual smoke test checklist covering authentication, admin panel flows, user management, and navigation to verify critical app functions after deployment.",
  "frontend/src/App.tsx": "Root React component setting up error boundaries, themes, routing, React Query, and service worker registration.",
  "frontend/src/components/admin/AddUserDialog.tsx": "Admin modal for creating users with email, password, mobile, role, and optional access expiry handling.",
  "frontend/src/components/admin/AdminCredentialLoginForm.tsx": "Admin-only login form using credentials instead of Internet Identity, with validation and error display.",
  "frontend/src/components/admin/AdminOnlyGate.tsx": "Wrapper component that checks admin status and shows loading or access-denied screens before rendering children.",
  "frontend/src/components/admin/AdminPortalLayout.tsx": "Layout wrapper for admin pages with title header and optional back-to-admin navigation.",
  "frontend/src/components/admin/CreateCredentialDialog.tsx": "Empty placeholder file for a credential creation dialog.",
  "frontend/src/components/admin/CredentialsTable.tsx": "Empty placeholder file intended for a credentials listing table.",
  "frontend/src/components/admin/ResetPasswordDialog.tsx": "Empty placeholder file for an admin password reset dialog.",
  "frontend/src/components/admin/RevokeCredentialDialog.tsx": "Empty placeholder file for a credential revocation dialog.",
  "frontend/src/components/admin/SetAccessUntilDialog.tsx": "Admin dialog to set or clear user access expiry dates, with validation and backend update logic.",
  "frontend/src/components/admin/SetCredentialRoleDialog.tsx": "Empty placeholder file for a credential role-setting dialog.",
  "frontend/src/components/admin/UsersTable.tsx": "Admin table listing all users with delete, access, and dashboard actions, handling loading, errors, and empty states.",
  "frontend/src/components/AppAccessGate.tsx": "No-op wrapper component retained for compatibility that simply renders its children.",
  "frontend/src/components/AppAccessLoginForm.tsx": "Deprecated login form component showing a notice that Internet Identity is required.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches application errors and shows a fallback screen.",
  "frontend/src/components/AppShell.tsx": "Main app layout with header, navigation, footer, and container for page content.",
  "frontend/src/components/auth/CredentialSignInForm.tsx": "Form for credential-based sign-in with client validation and mutation handling.",
  "frontend/src/components/auth/SignUpDialog.tsx": "Dialog for creating an account with validation, signup mutation, and success confirmation.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate handling Internet Identity login, credential login UI, and loading states.",
  "frontend/src/components/customers/CustomerFormDialog.tsx": "Dialog for adding or editing a customer with backend readiness checks and form validation.",
  "frontend/src/components/customers/CustomersTable.tsx": "Table to display, edit, and delete customers with loading and empty states.",
  "frontend/src/components/ErrorFallbackScreen.tsx": "UI for displaying application errors with reload and sign-in recovery actions.",
  "frontend/src/components/FirstAdminSetupDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/forms/ScrollableSelectContent.tsx": "Wrapper adding scrollability and iOS-friendly behavior to SelectContent.",
  "frontend/src/components/gst/GstProfileSection.tsx": "Renders a GST profile card showing GSTIN, status badges, and various registration details using reusable rows.",
  "frontend/src/components/invoices/InvoiceLineItemsEditor.tsx": "Provides a table-based editor for invoice line items, allowing item selection, quantity/price updates, and deletion.",
  "frontend/src/components/invoices/InvoiceStatusBadge.tsx": "Displays a status badge for invoices based on draft, finalized, or cancelled states.",
  "frontend/src/components/invoices/MonthlyInvoiceSummary.tsx": "Computes and displays monthly invoice totals including GST breakdowns, with optional month/year filtering.",
  "frontend/src/components/items/ItemFormDialog.tsx": "Dialog form for adding or editing items with validation, mutation hooks, and success/error handling.",
  "frontend/src/components/items/ItemsTable.tsx": "Shows a table of items with edit and delete actions, including loading and empty states.",
  "frontend/src/components/LoginButton.tsx": "Auth button handling Internet Identity login/logout, showing loading states and clearing cached data on sign-out.",
  "frontend/src/components/MobileNav.tsx": "Mobile slide-out navigation menu with route links and external E-Way Bill link.",
  "frontend/src/components/PrintLayout.tsx": "Minimal authenticated layout for print views that only renders AuthGate, profile setup, and children.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to enter their name and save their profile before using the app.",
  "frontend/src/components/pwa/IosInstallHelpDialog.tsx": "Dialog explaining step‑by‑step how to install the PWA on iOS through Safari’s Add to Home Screen flow.",
  "frontend/src/components/pwa/PwaInstallFooterSection.tsx": "UI footer component offering Android and iOS PWA install actions with fallback dialogs and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminCredentialSignIn.ts": "Mutation hook allowing admin credential authentication via the current actor and refreshing admin queries on success.",
  "frontend/src/hooks/useAdminUserDashboard.ts": "Provides hooks to fetch a user's invoice KPIs and find user details from the admin user list.",
  "frontend/src/hooks/useAdminUsers.ts": "Admin hooks for listing, creating, deleting users and setting access expiry, each tied to backend actor state.",
  "frontend/src/hooks/useBackendReady.ts": "Checks whether the backend actor is ready and provides a status message for UI use.",
  "frontend/src/hooks/useCredentialSignIn.ts": "Handles credential login requiring Internet Identity, ensuring identity availability before backend authentication.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current caller’s user profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries backend to determine whether the authenticated user is an admin with appropriate loading states.",
  "frontend/src/hooks/usePrintOnce.ts": "Triggers window.print() once when ready and optionally runs a callback after printing.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA installability, handles beforeinstallprompt events, detects iOS, and exposes an install prompt function.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on user profiles, business profiles, customers, and related data via an actor API.",
  "frontend/src/hooks/useRecordInternetIdentitySignIn.ts": "Provides a helper to asynchronously record Internet Identity sign-ins with retry logic and non-blocking error handling.",
  "frontend/src/hooks/useSafeInternetIdentityLogin.ts": "Wraps Internet Identity login with automatic stale-session recovery and retry behavior.",
  "frontend/src/hooks/useSignUp.ts": "Mutation hook for creating new user accounts through the actor’s sign‑up endpoint.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining color variables, dark mode, safe-area support, touch improvements, and print styles.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page that gates access via admin credentials and displays user management tools once authenticated.",
  "frontend/src/pages/AdminUserDashboardPage.tsx": "Dashboard page for admins to view a specific user’s details and invoice KPIs with loading and error states.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with search, table display, error handling, and a dialog for creating or editing customers.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing invoice stats, GST totals, setup prompts, and navigation to invoice-related features.",
  "frontend/src/pages/GstFilingStatusPage.tsx": "Page to check GST filing status by GSTIN, financial year, return type, and frequency with search, refresh, and status display.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Displays full invoice details with actions for editing, printing, finalizing, deleting, and cancelling.",
  "frontend/src/pages/InvoiceEditorPage.tsx": "Form page for creating or editing invoices, including line items, customer selection, numbering, and totals.",
  "frontend/src/pages/InvoicePrintPage.tsx": "Generates a printable invoice view with tax breakdowns, customer details, and automatic print workflow.",
  "frontend/src/pages/InvoicesPage.tsx": "Invoice listing page with filters for status, date, year, and month, displaying invoice tables and summaries. Fetches invoices, customers, items, and business profile data.",
  "frontend/src/pages/ItemsPage.tsx": "Displays and manages items with search, add, and edit functionality using a dialog and table. Handles loading and error states from the items query.",
  "frontend/src/pages/SettingsPage.tsx": "Business settings form allowing editing of profile, GST, banking details, and logo upload with validation. Loads and saves settings via backend queries.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker, checks for updates periodically, and logs update availability. Handles registration success and failure.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route tree including app, print, and admin layouts and all related pages. Configures error handling and nested routes.",
  "frontend/src/utils/adminTimeFormat.ts": "Utility functions to format backend nanosecond timestamps into readable date/time strings and convert Date to backend time. Includes validation handling.",
  "frontend/src/utils/amountInWordsINR.ts": "Converts numeric amounts into Indian Rupee words using crore, lakh, thousand formats. Includes helpers for number grouping and wording.",
  "frontend/src/utils/appAccessStorage.ts": "LocalStorage helpers for storing and clearing app access flags per principal, kept for backward compatibility. Includes functions to clear individual or all entries.",
  "frontend/src/utils/dateFormat.ts": "Date utilities for formatting and parsing invoice dates, plus extracting invoice year and month. Handles invalid dates safely.",
  "frontend/src/utils/financialYears.ts": "Generates the last five Indian financial year strings based on the current date. Accounts for FY starting in April.",
  "frontend/src/utils/formatters.ts": "Provides a simple INR currency formatter using Intl.NumberFormat.",
  "frontend/src/utils/gstCalculations.ts": "Computes invoice totals including GST split by CGST/SGST or IGST and provides currency formatting.",
  "frontend/src/utils/gstFilingStatusDisplay.ts": "Normalizes backend GST filing statuses into clear labels and badge variants.",
  "frontend/src/utils/indianStates.ts": "Exports a constant list of Indian states and union territories.",
  "frontend/src/utils/invoiceNumbering.ts": "Generates formatted invoice numbers using business profile settings with fallback logic.",
  "frontend/src/utils/invoiceRules.ts": "Defines invoice deletion rules, currently allowing all deletions with a fixed error message.",
  "frontend/src/utils/invoiceTaxBreakdown.ts": "Builds a GST tax breakdown by HSN/SAC, calculating CGST/SGST/IGST totals based on state comparison.",
  "frontend/src/utils/passwordHash.ts": "Empty placeholder file for password hashing utilities.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameters, including retrieval, persistence, and cleanup.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into user-friendly messages with normalization rules.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata, architecture notes, issues, and feature registry for GST Pro."
}