{
  "backend/main.mo": "Main actor defining user, business, customer, item, and invoice types with maps for per‑user storage, authorization mixins, GST filing status types, and initial state setup.",
  "backend/migration.mo": "Migration module converting OldInvoice records to NewInvoice by adding invoiceNumber and purchaseOrderNumber during canister upgrade.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for recent UI and workflow changes.",
  "frontend-file-summaries.txt": "Collection of autogenerated short summaries describing the purpose of various frontend React components, pages, hooks, and PWA files.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables, theme layers, dark mode values, and global element styles.",
  "frontend/index.html": "PWA‑optimized HTML entry point with manifest links, icons, favicons, and extensive iOS splash‑screen declarations.",
  "frontend/public/manifest.webmanifest": "Defines PWA settings such as app name, theme, start URL, and icons for GST Pro.",
  "frontend/public/sw.js": "Service worker implementing caching strategies for static assets and navigation with cache cleanup and fallbacks.",
  "frontend/SMOKE_TEST.md": "Manual smoke‑test checklist covering authentication, admin panel, and critical user flows for deployment verification.",
  "frontend/src/App.tsx": "Main app entry setting up React Query, routing, theming, error boundaries, and service worker registration.",
  "frontend/src/components/admin/AddUserDialog.tsx": "Dialog for admins to create a user with email, password, mobile, role, and optional access expiry.",
  "frontend/src/components/admin/AdminCredentialLoginForm.tsx": "Admin‑only login form using direct backend credentials with validation and error handling.",
  "frontend/src/components/admin/AdminOnlyGate.tsx": "Gate component that loads admin status and either shows children, loading, or access‑denied UI.",
  "frontend/src/components/admin/AdminPortalLayout.tsx": "Layout wrapper for admin pages with title header and optional back‑to‑admin button.",
  "frontend/src/components/admin/CreateCredentialDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/CredentialsTable.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/ResetPasswordDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RevokeCredentialDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/SetAccessUntilDialog.tsx": "Dialog allowing admins to set or clear a user’s access expiry date with validation and mutations.",
  "frontend/src/components/admin/SetCredentialRoleDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/UsersTable.tsx": "Admin table listing all users with role badges, access info, delete and access‑expiry controls.",
  "frontend/src/components/AppAccessGate.tsx": "No-op wrapper component that always renders children for Version 9 compatibility.",
  "frontend/src/components/AppAccessLoginForm.tsx": "Deprecated access form showing a notice that login is handled solely via Internet Identity.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary that catches runtime errors and displays a fallback screen.",
  "frontend/src/components/AppShell.tsx": "Main application layout with header, navigation, footer, and PWA install section.",
  "frontend/src/components/auth/CredentialSignInForm.tsx": "Sign-in form handling email/password input, client-side validation, and credential sign-in mutation with error display.",
  "frontend/src/components/auth/SignUpDialog.tsx": "Sign‑up dialog with form validation, sign‑up mutation, success message flow, and automatic dialog closing.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication flow using Internet Identity or credentials, showing login UI when unauthenticated.",
  "frontend/src/components/customers/CustomerFormDialog.tsx": "Dialog for adding or editing customers with form state management, validation, and submit mutations.",
  "frontend/src/components/customers/CustomersTable.tsx": "Table listing customers with edit/delete actions and a confirmation dialog for deletions.",
  "frontend/src/components/ErrorFallbackScreen.tsx": "Displays an error message with options to reload or sign in after an application failure.",
  "frontend/src/components/FirstAdminSetupDialog.tsx": "Empty placeholder file for first admin setup dialog.",
  "frontend/src/components/forms/ScrollableSelectContent.tsx": "Scrollable wrapper for select content ensuring consistent cross‑platform scrolling behavior.",
  "frontend/src/components/gst/GstProfileSection.tsx": "Displays GST profile details with status badges and structured profile rows based on filing status data.",
  "frontend/src/components/invoices/InvoiceLineItemsEditor.tsx": "UI component to add, edit, and remove invoice line items with quantity, price, discount, and item selection.",
  "frontend/src/components/invoices/InvoiceStatusBadge.tsx": "Displays a badge indicating whether an invoice is Draft or Finalized.",
  "frontend/src/components/invoices/MonthlyInvoiceSummary.tsx": "Computes and displays monthly aggregated invoice totals with GST breakdown and optional filtering.",
  "frontend/src/components/items/ItemFormDialog.tsx": "Dialog form for creating or editing an item, including validation and save logic.",
  "frontend/src/components/items/ItemsTable.tsx": "Shows a table of items with edit and delete actions and handles empty and loading states.",
  "frontend/src/components/LoginButton.tsx": "Provides sign-in and sign-out logic using Internet Identity with UI feedback and query cache management.",
  "frontend/src/components/MobileNav.tsx": "Responsive mobile navigation sheet with route links, active highlighting, and an external E‑Way Bill link.",
  "frontend/src/components/PrintLayout.tsx": "Minimal authenticated layout wrapper for print‑focused pages without standard app chrome.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new users for their name and saves the profile before allowing app use.",
  "frontend/src/components/pwa/IosInstallHelpDialog.tsx": "Dialog explaining step-by-step instructions to install the PWA on iOS.",
  "frontend/src/components/pwa/PwaInstallFooterSection.tsx": "Footer section offering Android and iOS PWA installation options with prompts and help dialog.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminCredentialSignIn.ts": "Provides an admin-only credential sign-in mutation that authenticates via the current actor and refreshes admin state.",
  "frontend/src/hooks/useAdminUserDashboard.ts": "Fetches user invoice KPIs and retrieves user details from the admin user list using actor-based admin queries.",
  "frontend/src/hooks/useAdminUsers.ts": "Supplies admin CRUD operations for users and lists all users, invalidating related queries after mutations.",
  "frontend/src/hooks/useCredentialSignIn.ts": "Handles user credential login with automatic Internet Identity initialization and retries until an authenticated actor is available.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller’s user profile, updating cached profile data when changed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and offering login and logout utilities.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks whether the current user is an admin using the actor, caching the result for short periods.",
  "frontend/src/hooks/usePrintOnce.ts": "Triggers window.print a single time when ready and optionally runs a callback after printing.",
  "frontend/src/hooks/usePwaInstall.ts": "Detects PWA installability, manages beforeinstallprompt events, and exposes a function to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Collection of actor-driven queries and mutations for user profiles, business profiles, customers, invoices, and related entities.",
  "frontend/src/hooks/useRecordInternetIdentitySignIn.ts": "Provides a hook that waits for an actor and logs Internet Identity sign-in events without blocking UI.",
  "frontend/src/hooks/useSafeInternetIdentityLogin.ts": "Wraps Internet Identity login with logic to clear stale sessions and retry authentication safely.",
  "frontend/src/hooks/useSignUp.ts": "Defines a mutation hook that signs up new users via the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS config defining theme variables, safe-area rules, mobile touch behavior, and print styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page that prompts for admin credentials and displays admin tools when authenticated.",
  "frontend/src/pages/AdminUserDashboardPage.tsx": "Admin dashboard showing a selected user's details, sign-in state, and invoice KPIs.",
  "frontend/src/pages/CustomersPage.tsx": "Provides customer management with search, listing, and create/edit dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard summarizing invoices, GST totals, and navigation shortcuts for key actions.",
  "frontend/src/pages/GstFilingStatusPage.tsx": "Provides a UI to search GSTINs, select periods and return types, fetch GST filing status, and display normalized status entries with badges.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Displays invoice details with totals, status, customer info, and actions for editing, finalizing, deleting, or printing the invoice.",
  "frontend/src/pages/InvoiceEditorPage.tsx": "Handles creating and editing invoices, including line items, customer selection, invoice metadata, and form validation with save actions.",
  "frontend/src/pages/InvoicePrintPage.tsx": "Loads invoice, customer, item, and business data to render a print‑ready invoice layout and triggers automatic printing once ready.",
  "frontend/src/pages/InvoicesPage.tsx": "Lists invoices with filters for status, date, month, and year, and supports navigation to individual invoice pages.",
  "frontend/src/pages/ItemsPage.tsx": "Shows and filters items, handles add/edit via a dialog, and displays errors or loading states for item data.",
  "frontend/src/pages/SettingsPage.tsx": "React page for viewing and updating business profile settings, including logo upload with validation and save handling.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and logs update availability.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route hierarchy for the app, including app, print, and admin layouts and pages.",
  "frontend/src/utils/adminTimeFormat.ts": "Converts backend bigint nanosecond timestamps to readable date or datetime strings and back.",
  "frontend/src/utils/appAccessStorage.ts": "Deprecated localStorage helpers for tracking app-access state per principal, kept for compatibility.",
  "frontend/src/utils/dateFormat.ts": "Utility functions for parsing, formatting, and extracting parts of invoice-related dates.",
  "frontend/src/utils/financialYears.ts": "Generates the last five Indian financial year strings based on the current date.",
  "frontend/src/utils/formatters.ts": "Formats numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/utils/gstCalculations.ts": "Computes invoice totals including GST breakdown and provides related formatting helpers.",
  "frontend/src/utils/gstFilingStatusDisplay.ts": "Normalizes GST filing status text and maps it to displayable labels and badge variants.",
  "frontend/src/utils/indianStates.ts": "Exports a constant list of all Indian states and union territories.",
  "frontend/src/utils/invoiceNumbering.ts": "Generates invoice numbers using business profile settings and selects the appropriate displayed number.",
  "frontend/src/utils/invoiceRules.ts": "Provides rules for invoice deletion and corresponding error messages.",
  "frontend/src/utils/passwordHash.ts": "Empty placeholder file for password hashing utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, storing them in sessionStorage, and clearing them for navigation persistence.",
  "frontend/src/utils/userFacingError.ts": "Converts various error types into user-friendly messages with cleanup and specific error-case handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the GST Pro project state, including versions, architectural notes, known issues, and existing features."
}