{
  "backend/main.mo": "Defines the main actor with storage, access control, business profiles including banking details, and CRUD structures for customers, items, and invoices along with GST filing types.",
  "backend/migration.mo": "Contains migration logic and old/new data structure definitions to upgrade BusinessProfile to include banking details and preserve user, invoice, and item data.",
  "feature_evidence.json": "Lists feature evidence for banking details UI updates in settings and invoice views, including associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for multiple frontend components, pages, utilities, and PWA files used across the application.",
  "frontend/index.css": "Tailwind-based global styling file defining OKLCH color variables, dark mode values, and base UI styling rules.",
  "frontend/index.html": "Main HTML entry configuring PWA metadata, icons, and iOS splash screens for GST Pro.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and launch settings.",
  "frontend/public/sw.js": "Service worker implementing caching, offline support, and cache-first/network-first strategies for assets and navigation.",
  "frontend/SMOKE_TEST.md": "Manual smoke test checklist describing key authentication, admin panel, and user management flows to verify after deployment.",
  "frontend/src/App.tsx": "Root React component setting up routing, theming, query client config, and service worker registration.",
  "frontend/src/components/admin/AddUserDialog.tsx": "Dialog for admins to create users with credentials, roles, and optional access expiry.",
  "frontend/src/components/admin/AdminCredentialLoginForm.tsx": "Admin login form using direct credentials instead of Internet Identity.",
  "frontend/src/components/admin/AdminOnlyGate.tsx": "Protects admin pages by showing loading, access denied, or authorized content.",
  "frontend/src/components/admin/AdminPortalLayout.tsx": "Layout wrapper for admin pages with title and optional back button.",
  "frontend/src/components/admin/CreateCredentialDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/CredentialsTable.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/ResetPasswordDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/RevokeCredentialDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/SetAccessUntilDialog.tsx": "Dialog for admins to set or clear a user's access‑until expiry timestamp.",
  "frontend/src/components/admin/SetCredentialRoleDialog.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/UsersTable.tsx": "Displays a full admin user list with role badges, access controls, deletion, and navigation to user dashboards.",
  "frontend/src/components/AppAccessGate.tsx": "No-op wrapper component that simply renders children, replacing prior access gating.",
  "frontend/src/components/AppAccessLoginForm.tsx": "Deprecated login form kept for compatibility, instructing users to use Internet Identity instead.",
  "frontend/src/components/AppErrorBoundary.tsx": "Error boundary capturing React errors and displaying a fallback screen.",
  "frontend/src/components/AppShell.tsx": "Layout shell providing header navigation, footer, and container structure around page content.",
  "frontend/src/components/auth/CredentialSignInForm.tsx": "Provides an email/password sign‑in form with validation, error display, and mutation‑based authentication.",
  "frontend/src/components/auth/SignUpDialog.tsx": "Implements a modal sign‑up flow with validation, success messaging, and account creation via mutation.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper handling Internet Identity login, credential login UI, and loading states.",
  "frontend/src/components/customers/CustomerFormDialog.tsx": "Dialog for adding or editing customers with form validation and mutation‑based save operations.",
  "frontend/src/components/customers/CustomersTable.tsx": "Renders a customers table with edit/delete actions, loading and empty states, and delete confirmation.",
  "frontend/src/components/ErrorFallbackScreen.tsx": "UI screen shown on fatal errors with reload and optional sign‑in actions.",
  "frontend/src/components/FirstAdminSetupDialog.tsx": "Empty placeholder file for first‑admin setup dialog.",
  "frontend/src/components/forms/ScrollableSelectContent.tsx": "Scrollable wrapper for SelectContent ensuring consistent overflow behavior across devices.",
  "frontend/src/components/gst/GstProfileSection.tsx": "Displays GST profile details with badges, conditional rows, and fallback messaging.",
  "frontend/src/components/invoices/InvoiceLineItemsEditor.tsx": "Provides a table-based editor for invoice line items with add, remove, and update functionality.",
  "frontend/src/components/invoices/InvoiceStatusBadge.tsx": "Renders a status badge for an invoice based on its current status.",
  "frontend/src/components/invoices/MonthlyInvoiceSummary.tsx": "Generates and displays monthly invoice totals with filtering by month and year.",
  "frontend/src/components/items/ItemFormDialog.tsx": "Dialog form for creating or editing an item with validation and API mutation hooks.",
  "frontend/src/components/items/ItemsTable.tsx": "Shows items in a responsive table with edit and delete actions and empty/loading states.",
  "frontend/src/components/LoginButton.tsx": "Provides a sign-in/sign-out button handling Internet Identity auth, logout cleanup, and loading states.",
  "frontend/src/components/MobileNav.tsx": "Responsive mobile navigation drawer with links and an external E‑Way Bill shortcut.",
  "frontend/src/components/PrintLayout.tsx": "Minimal authenticated layout for print views, including profile setup enforcement.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new users for their name and saves the profile before allowing app use.",
  "frontend/src/components/pwa/IosInstallHelpDialog.tsx": "Dialog explaining steps to install the PWA on iOS home screen.",
  "frontend/src/components/pwa/PwaInstallFooterSection.tsx": "Renders install buttons for Android and iOS using the PWA install hook and shows confirmation or help dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminCredentialSignIn.ts": "Provides a mutation to authenticate admin credentials through the backend and refresh admin-related queries.",
  "frontend/src/hooks/useAdminUserDashboard.ts": "Fetches admin-only user invoice KPIs and retrieves user details from the cached users list.",
  "frontend/src/hooks/useAdminUsers.ts": "Admin hooks for listing, creating, deleting users and updating access expiry, all backed by the actor.",
  "frontend/src/hooks/useCredentialSignIn.ts": "Handles normal user sign-in by ensuring II login, acquiring an authenticated actor, and validating credentials.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and saves the caller's user profile using the authenticated actor with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and state for authentication flow.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries the backend to check if the current user is an admin with appropriate loading and caching.",
  "frontend/src/hooks/usePrintOnce.ts": "Triggers window.print once when data is ready and optionally runs a callback after printing.",
  "frontend/src/hooks/usePwaInstall.ts": "Tracks PWA installability, handles beforeinstallprompt events, and exposes a method to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, business profiles, customers, and related entities through the actor API.",
  "frontend/src/hooks/useRecordInternetIdentitySignIn.ts": "Provides a helper hook to asynchronously record Internet Identity sign‑in events with retry logic and non-blocking error handling.",
  "frontend/src/hooks/useSafeInternetIdentityLogin.ts": "Adds a safe wrapper around Internet Identity login that clears stale sessions and retries login when needed.",
  "frontend/src/hooks/useSignUp.ts": "Implements a mutation hook for signing up users via the actor's signUp API call.",
  "frontend/src/index.css": "Contains Tailwind setup, theme variables, dark mode styles, mobile safe-area handling, touch optimizations, and print styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders the admin panel, showing an admin login form when needed and the management interface for authorized admins.",
  "frontend/src/pages/AdminUserDashboardPage.tsx": "Displays an admin-only dashboard for a specific user, including user details, sign-in status, and invoice KPI metrics.",
  "frontend/src/pages/CustomersPage.tsx": "Shows a searchable customer list with add/edit functionality using dialogs and customer-related queries.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard showing invoice KPIs, GST totals, and setup prompts, using various data queries and navigation actions.",
  "frontend/src/pages/GstFilingStatusPage.tsx": "Provides a GST filing status lookup with GSTIN search, FY selection, return type filters, and status table display.",
  "frontend/src/pages/InvoiceDetailPage.tsx": "Displays full invoice details with totals, customer info, and actions to finalize, cancel, delete, or print the invoice.",
  "frontend/src/pages/InvoiceEditorPage.tsx": "Handles creating and editing invoices, including line item editing, customer/item dialogs, and total calculation.",
  "frontend/src/pages/InvoicePrintPage.tsx": "Generates a printable invoice layout with business info, line items, totals, and auto-print trigger once data is loaded.",
  "frontend/src/pages/InvoicesPage.tsx": "Lists invoices with filters for status and date, displays summaries, and links to invoice actions. Uses queries for invoices, customers, items, and profile.",
  "frontend/src/pages/ItemsPage.tsx": "Displays and filters items with search, and provides dialogs for creating or editing items. Handles loading and error states.",
  "frontend/src/pages/SettingsPage.tsx": "Manages business profile settings including basic info, banking details, and logo upload. Loads existing data and submits updates with validation.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates periodically, and logs update availability. Handles registration errors.",
  "frontend/src/routeTree.tsx": "Defines the full TanStack Router route tree, including app, print, and admin layouts and all page routes. Provides error and not-found handling.",
  "frontend/src/utils/adminTimeFormat.ts": "Formats bigint nanosecond timestamps into readable date/time or date-only strings. Includes conversion from Date to backend time.",
  "frontend/src/utils/appAccessStorage.ts": "Provides deprecated localStorage helpers for tracking per-principal app access. Includes functions to set, clear, and check stored access flags.",
  "frontend/src/utils/dateFormat.ts": "Utilities for formatting and parsing invoice dates and extracting year or month. Ensures safe fallbacks for invalid dates.",
  "frontend/src/utils/financialYears.ts": "Generates the last five Indian financial years based on current date. Uses April–March financial year rules.",
  "frontend/src/utils/formatters.ts": "Formats numbers as INR currency using Indian locale formatting.",
  "frontend/src/utils/gstCalculations.ts": "Computes invoice totals, discounts, GST components, and grand total, determining inter‑ vs intra‑state taxation. Includes a helper to calculate totals from an invoice object.",
  "frontend/src/utils/gstFilingStatusDisplay.ts": "Normalizes raw GST filing status strings into consistent labels and maps them to badge variants.",
  "frontend/src/utils/indianStates.ts": "Exports a constant list of all Indian states and union territories.",
  "frontend/src/utils/invoiceNumbering.ts": "Generates formatted invoice numbers using business profile settings and falls back to stored invoice numbers when present.",
  "frontend/src/utils/invoiceRules.ts": "Allows all invoices to be deleted and provides a generic deletion error message.",
  "frontend/src/utils/passwordHash.ts": "Empty placeholder file for password hashing utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based routing params.",
  "frontend/src/utils/userFacingError.ts": "Converts technical or backend error messages into user-friendly text with special handling for common cases.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and content paths.",
  "project_state.json": "Defines project metadata, architecture notes, known issues, and existing features for GST Pro."
}