{
  "kind": "build_request",
  "title": "Add Banking Details in Settings and Include Them on All Invoices",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-146",
      "text": "Extend the backend BusinessProfile model to store optional banking details that can be configured once in Settings and then reused on all invoices. Banking details must include at minimum: Account Name, Account Number, IFSC Code, Bank Name, and Branch (optional).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "invoice add banking details like account number ifsc code name and etc it can user add through settings and all invoice have this details."
        ]
      },
      "acceptanceCriteria": [
        "Backend BusinessProfile type includes new optional fields for banking details (Account Name, Account Number, IFSC Code, Bank Name, and optional Branch).",
        "Existing BusinessProfile data for existing users remains readable after upgrade (missing banking fields default to null/empty option).",
        "Business profile get/save APIs correctly persist and return the banking details for the signed-in Principal."
      ]
    },
    {
      "id": "REQ-147",
      "text": "If the backend uses stable storage for BusinessProfile across upgrades, add conditional migration logic (backend/migration.mo) to safely migrate existing BusinessProfile records to include the new optional banking fields without data loss.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "it can user add through settings and all invoice have this details."
        ]
      },
      "acceptanceCriteria": [
        "On canister upgrade, existing BusinessProfile records are migrated so that new banking fields are initialized to null/empty option values.",
        "No traps occur during upgrade/migration when older BusinessProfile records (without banking fields) are present."
      ]
    },
    {
      "id": "REQ-148",
      "text": "Update the Settings page (frontend/src/pages/SettingsPage.tsx) to allow the user to add/edit banking details (Account Name, Account Number, IFSC Code, Bank Name, Branch). These fields must be saved as part of the Business Profile using the existing business profile save flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "it can user add through settings"
        ]
      },
      "acceptanceCriteria": [
        "Settings page displays a clearly labeled section (e.g., \"Banking Details\") with inputs for Account Name, Account Number, IFSC Code, Bank Name, and Branch.",
        "Saving Settings persists banking details via the existing useSaveBusinessProfile() mutation and they are reloaded correctly via useGetBusinessProfile().",
        "All user-facing labels and validation messages for these fields are in English."
      ]
    },
    {
      "id": "REQ-149",
      "text": "Render the saved banking details on invoice experiences so that all invoices include these details when present: (1) Invoice print layout (frontend/src/pages/InvoicePrintPage.tsx) and (2) Invoice detail view (frontend/src/pages/InvoiceDetailPage.tsx). If banking details are not configured, the banking section must be hidden (no empty labels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "and all invoice have this details."
        ]
      },
      "acceptanceCriteria": [
        "InvoicePrintPage shows a \"Banking Details\" section containing configured banking fields (Account Name, Account Number, IFSC Code, Bank Name, and Branch if set).",
        "InvoiceDetailPage shows the same banking details section (using BusinessProfile data) when configured.",
        "If none of the banking fields are set, the banking section does not render (no blank rows/labels).",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture with all logic in backend/main.mo; only add backend/migration.mo changes if required for stable upgrade compatibility.",
    "Do not modify any frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Banking details must be stored and retrieved as part of the user-scoped BusinessProfile (scoped to the signed-in Principal), not as per-invoice duplicated data unless required for backward compatibility."
  ],
  "nonGoals": [
    "Do not implement payment collection, payment links, UPI QR generation, or payment status tracking.",
    "Do not integrate with external banking verification APIs.",
    "Do not change invoice tax/GST calculations as part of this work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}