{
  "kind": "build_request",
  "title": "Add editable invoice number + purchase order number, verify E‑Way Bill link, and enable GSTIN search for full GST profile/status",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-135",
      "text": "Extend the backend Invoice data model to store (a) an editable invoice number and (b) an optional purchase order number, and persist these fields for invoice create/edit/get/list flows.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "add purchase order number and invoice number is editable in invoice3 section"
        ]
      },
      "acceptanceCriteria": [
        "Backend `Invoice` type includes new fields for `invoiceNumber` (editable text) and `purchaseOrderNumber` (optional text).",
        "`createInvoice` and `editInvoice` accept and persist the new fields.",
        "`getInvoice` / `getInvoices` return the new fields so the frontend can render them.",
        "Existing invoices created before this change continue to load without traps (missing fields default safely)."
      ]
    },
    {
      "id": "REQ-136",
      "text": "Update the invoice editor UI to allow the user to enter/edit the Invoice Number and Purchase Order Number in the invoice details section, and save them to the backend during invoice create and edit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "add purchase order number and invoice number is editable in invoice3 section"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/InvoiceEditorPage.tsx`, the form includes inputs labeled \"Invoice Number\" and \"Purchase Order Number\" (English).",
        "When creating a new invoice, the entered Invoice Number and Purchase Order Number are sent to the backend and persisted.",
        "When editing an invoice, existing values are pre-filled and can be updated and saved.",
        "If the user leaves Invoice Number empty, the app continues to work (no crashes) and other invoice fields can still be saved."
      ]
    },
    {
      "id": "REQ-137",
      "text": "Render the stored Invoice Number and Purchase Order Number in the invoice detail view and print layout, using the stored invoice number when present (and falling back to the generated formatted number only when no stored invoice number exists).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "add purchase order number and invoice number is editable in invoice3 section"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pages/InvoiceDetailPage.tsx` shows \"Invoice Number\" using the stored invoice number when available; otherwise it shows the current formatted fallback.",
        "`frontend/src/pages/InvoicePrintPage.tsx` shows \"Invoice No\" using the stored invoice number when available; otherwise it shows the current formatted fallback.",
        "`frontend/src/pages/InvoicePrintPage.tsx` includes a clearly labeled \"Purchase Order No\" field/row/line when a purchase order number exists, and hides it (or shows a neutral placeholder) when it is not set.",
        "All labels and helper text remain in English."
      ]
    },
    {
      "id": "REQ-138",
      "text": "Ensure that clicking the in-app \"E‑Way Bill\" action opens https://ewaybillgst.gov.in/Login.aspx in a new browser tab/window.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "when user click on  eway bill make https://ewaybillgst.gov.in/Login.aspx this url to open"
        ]
      },
      "acceptanceCriteria": [
        "From the authenticated UI, clicking \"E‑Way Bill\" opens exactly `https://ewaybillgst.gov.in/Login.aspx` in a new tab/window.",
        "No other E‑Way Bill targets (e.g., `https://ewaybillgst.gov.in/`) are used by the UI entry points."
      ]
    },
    {
      "id": "REQ-139",
      "text": "Update the GST Status page to support searching any GSTIN and displaying the full GST profile details and filing status for the entered GSTIN.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "in gst status user can serch any gst number which show all gst details about gst number and gst profile of gst number user like name, trade and and filling status"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/GstFilingStatusPage.tsx`, the user can enter any 15-character GSTIN and trigger a fetch (e.g., via a \"Search\" or \"Refresh Status\" action) without requiring the business profile GSTIN.",
        "After searching, the page displays GST profile details (including legal name and trade name when available) and the filing status table for the selected return type and period.",
        "Loading, empty, and error states remain clear and in English (no blank sections or runtime errors when searching different GSTINs)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not modify files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify immutable frontend hook/entry paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not add new third-party authentication providers (only existing auth mechanisms).",
    "Do not add external databases or non-IC backend infrastructure.",
    "Do not redesign unrelated pages or change existing invoice tax calculation logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}