{
  "kind": "build_request",
  "title": "Fix backend connection readiness errors on Customer/Settings saves and update invoice layout (bank details, remove QR + delivery fields)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-156",
      "text": "Fix the issue where saving a Customer (from Customers page and invoice-related customer save flows) fails with a user-visible error like “connection of backend is not ready”, ensuring the save completes successfully when the user is signed in and the new/updated customer persists and appears immediately in the customers list.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "in application when we save  coustomer details of bills ... show connection of backend is not ready fix this"
        ]
      },
      "acceptanceCriteria": [
        "After successful sign-in, creating a new customer from Customers page succeeds without showing any “backend not ready”/connection error toast.",
        "After saving, the customer list updates immediately to include the new customer (no manual refresh).",
        "Editing an existing customer saves successfully and the updated values are visible immediately.",
        "If the backend actor/connection is not ready yet, the UI prevents submission and shows a clear English message (e.g., “Connecting to backend, please wait...”) instead of failing the mutation."
      ]
    },
    {
      "id": "REQ-157",
      "text": "Fix the issue where saving Settings (Business Profile) fails with a user-visible error like “connection of backend is not ready”, ensuring the save completes successfully when the user is signed in and the updated business profile persists.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "and in setting save details show connection of backend is not ready fix this"
        ]
      },
      "acceptanceCriteria": [
        "After successful sign-in, saving Settings (Business Profile) succeeds without showing any “backend not ready”/connection error toast.",
        "Reloading the app shows the saved Business Profile values (persistence verified).",
        "If the backend actor/connection is not ready yet, the Save action is disabled and the user sees a clear English helper message explaining they must wait for the connection."
      ]
    },
    {
      "id": "REQ-158",
      "text": "Update the invoice print/export layout to remove the QR option/QR section entirely (no QR label, placeholder, image, or empty space reserved for it).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "remove QR option in invoice"
        ]
      },
      "acceptanceCriteria": [
        "Invoice print page renders without any QR code section or QR-related text.",
        "The layout remains visually aligned (no awkward blank area where QR used to be).",
        "Printing the invoice produces a clean A4 output without the removed QR area."
      ]
    },
    {
      "id": "REQ-159",
      "text": "Update invoice print/export and any invoice detail/metadata layouts to remove the “Delivery Note” field and remove all of the following fields/labels completely: “Mode/Terms of Payment”, “Other References”, “Dispatch Doc No.”, “Delivery Note Date”, “Dispatched through”, “Destination”, and “Terms of Delivery”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "remove Delivery Note\n\n—\n\nMode/Terms of Payment\n\n—\n\nOther References Dispatch Doc No.\n\n—\n\nDelivery Note Date\n\n—\n\nDispatched through\n\n—\n\nDestination\n\n—\n\nTerms of Delivery"
        ]
      },
      "acceptanceCriteria": [
        "Invoice print page does not display: Delivery Note, Mode/Terms of Payment, Other References, Dispatch Doc No., Delivery Note Date, Dispatched through, Destination, Terms of Delivery.",
        "No empty rows/boxes/separators remain for these removed fields.",
        "Invoice detail view does not show these removed fields anywhere (if previously shown)."
      ]
    },
    {
      "id": "REQ-160",
      "text": "Ensure invoices include a clearly formatted “Banking Details” section sourced from the saved Business Profile banking details, and render it only when banking details are configured (hide the entire section when not configured).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "and in invoice add back details section"
        ]
      },
      "acceptanceCriteria": [
        "When Banking Details are configured in Settings, the invoice print layout shows a “Banking Details” section with the configured fields.",
        "When Banking Details are not configured, invoice print layout shows no Banking Details section (no empty labels).",
        "Invoice detail view continues to show banking details when configured (and hides it when not configured)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new invoice metadata fields beyond the requested removals (no new Delivery/Transport fields).",
    "Changing authentication method or introducing third-party auth providers.",
    "Adding QR generation or any alternate QR replacement.",
    "Changing invoice tax calculation logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}