{
  "kind": "build_request",
  "title": "Fix mobile navigation visibility and GST Status runtime/data issues",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-131",
      "text": "Fix the authenticated app navigation so that on mobile screen sizes users can reliably access both “Settings” (/settings) and “GST Status” (/gst-filing-status), including when the header nav is hidden (currently hidden on < md).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "in mobile it cannot show setting and gst status button fix it"
        ]
      },
      "acceptanceCriteria": [
        "On iPhone-sized viewports, there is a visible and usable navigation UI that includes entries for “Settings” and “GST Status”.",
        "Tapping “Settings” navigates to /settings and renders SettingsPage.",
        "Tapping “GST Status” navigates to /gst-filing-status and renders GstFilingStatusPage.",
        "Navigation items remain accessible without horizontal overflow or being clipped on small screens."
      ]
    },
    {
      "id": "REQ-132",
      "text": "Fix the GST Status page crash where the UI shows “ReturnType is not defined”, ensuring the page can render and the return-type selector works without runtime errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "it show ReturnType is not defined when user click on status show button"
        ]
      },
      "acceptanceCriteria": [
        "Opening /gst-filing-status and interacting with the return type controls does not throw “ReturnType is not defined” (or any other uncaught error).",
        "The return-type selection (GSTR-3B / GSTR-1) updates the displayed filing-status rows accordingly.",
        "The fix does not require modifying any files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths)."
      ]
    },
    {
      "id": "REQ-133",
      "text": "Ensure GST Status “Show/Refresh Status” functionality fetches real filing status data from the GST portal via the existing backend integration (https://services.gst.gov.in/services/searchtp) and displays the results in the GST Status table (Filed/Not filed plus filing date when available), with clear loading/empty/error states in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "in status it cnnot show filling status.",
          "when user click on status show button it must fatch data form gst portal then show filling status"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the GST Status refresh action triggers a backend call that attempts to fetch real data from https://services.gst.gov.in/services/searchtp (not placeholder/dummy results).",
        "When data is returned, the UI shows rows with Period, Status (clearly indicating Filed/Not filed), and Filing Date (or an English placeholder like “Not available”).",
        "When the upstream request fails or returns an error condition, the backend returns a frontend-friendly error object (not a trap), and the UI displays a clear English error message without a blank screen.",
        "Loading state is shown while fetching; empty state is shown when the call succeeds but no entries are available for the selected filters."
      ]
    },
    {
      "id": "REQ-134",
      "text": "Extend GST Status to display a more complete GST profile section (as available from the GST portal response) so the user can verify the GSTIN is correct, and render these profile fields in the GST Status page in English.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "and show user full profile which show in gst portal which user help to identify his gst number is right or wrong"
        ]
      },
      "acceptanceCriteria": [
        "Backend GST filing-status response includes additional GST profile fields (beyond the current isActive/legalName/tradeName) when available from the GST portal response, and the frontend types/bindings compile without type hacks.",
        "GST Status page renders a “GST Profile” (or equivalent) section that displays the available profile fields and clearly indicates Active/Inactive/Unknown status.",
        "If profile fields are missing/unavailable, the UI degrades gracefully (does not crash) and shows sensible English placeholders (e.g., “Not available”)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui sources; compose existing components instead.",
    "All user-facing text must be in English.",
    "GST Status data must be fetched from the GST portal endpoint https://services.gst.gov.in/services/searchtp (no dummy/placeholder behavior)."
  ],
  "nonGoals": [
    "Do not add new authentication providers or third-party login integrations.",
    "Do not redesign unrelated pages (Dashboard/Customers/Items/Invoices) beyond what is necessary to fix mobile navigation access.",
    "Do not introduce external databases or non-Internet-Computer backend services.",
    "Do not implement new GST features beyond fixing filing-status fetch/display and adding GST profile details for GSTIN verification."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Keep all user-facing text in English."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}