{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Banking details in Settings and invoices",
  "requirements": [
    {
      "id": "REQ-148",
      "summary": "Add Banking Details section to Settings and persist it via the existing BusinessProfile save/get flow.",
      "acceptanceCriteria": [
        "Settings page displays a clearly labeled section (e.g., \"Banking Details\") with inputs for Account Name, Account Number, IFSC Code, Bank Name, and Branch.",
        "Saving Settings persists banking details via the existing useSaveBusinessProfile() mutation and they are reloaded correctly via useGetBusinessProfile().",
        "All user-facing labels and validation messages for these fields are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Implement a new \"Banking Details\" form section using existing shadcn-ui form components (Card/Label/Input) to capture Account Name, Account Number, IFSC Code, Bank Name, and optional Branch; populate initial values from businessProfile.bankingDetails; on save, include bankingDetails in the existing saveBusinessProfile payload, omitting the object entirely when all fields are blank; add client-side validation so that when any banking field is entered, required fields (Account Name, Account Number, IFSC Code, Bank Name) must be present with English error messages. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-149",
      "summary": "Render configured BusinessProfile banking details on invoice print and invoice detail views, hiding the section when not configured.",
      "acceptanceCriteria": [
        "InvoicePrintPage shows a \"Banking Details\" section containing configured banking fields (Account Name, Account Number, IFSC Code, Bank Name, and Branch if set).",
        "InvoiceDetailPage shows the same banking details section (using BusinessProfile data) when configured.",
        "If none of the banking fields are set, the banking section does not render (no blank rows/labels).",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InvoicePrintPage.tsx",
          "operation": "modify",
          "description": "Add a conditional \"Banking Details\" section driven by businessProfile.bankingDetails; render only non-empty fields (Account Name, Account Number, IFSC Code, Bank Name, and Branch when set) and hide the entire section when all are missing/blank; ensure all labels are in English and match Settings terminology."
        },
        {
          "path": "frontend/src/pages/InvoiceDetailPage.tsx",
          "operation": "modify",
          "description": "Add a conditional \"Banking Details\" card/section in the invoice detail view using businessProfile.bankingDetails; render only non-empty fields and hide the entire section when all are missing/blank; ensure all labels are in English and match InvoicePrintPage."
        }
      ]
    }
  ]
}