{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix mobile nav access + stabilize and complete GST Status UI rendering",
  "requirements": [
    {
      "id": "REQ-131",
      "summary": "Add a mobile-friendly authenticated navigation UI so Settings and GST Status are always accessible on small screens.",
      "acceptanceCriteria": [
        "On iPhone-sized viewports, there is a visible and usable navigation UI that includes entries for “Settings” and “GST Status”.",
        "Tapping “Settings” navigates to /settings and renders SettingsPage.",
        "Tapping “GST Status” navigates to /gst-filing-status and renders GstFilingStatusPage.",
        "Navigation items remain accessible without horizontal overflow or being clipped on small screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MobileNav.tsx",
          "operation": "create",
          "description": "Create a small-screen navigation component that exposes all primary app routes (at minimum “GST Status” and “Settings”) using shadcn-ui primitives (e.g., Sheet/DropdownMenu) for a reliable mobile menu. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the new MobileNav into the authenticated header for < md breakpoints (where the current header nav is hidden) so users can always reach /settings and /gst-filing-status without overflow/clipping. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-132",
      "summary": "Eliminate the “ReturnType is not defined” runtime crash on GST Status and ensure return-type selection works reliably.",
      "acceptanceCriteria": [
        "Opening /gst-filing-status and interacting with the return type controls does not throw “ReturnType is not defined” (or any other uncaught error).",
        "The return-type selection (GSTR-3B / GSTR-1) updates the displayed filing-status rows accordingly.",
        "The fix does not require modifying any files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GstFilingStatusPage.tsx",
          "operation": "modify",
          "description": "Audit and fix any runtime references to a non-existent ReturnType symbol by ensuring only the generated runtime enum ReturnType_ is used as a value (and any TypeScript-only types are not referenced at runtime). Keep the return-type controls bound to selectedReturnType and ensure filtering uses entry.returnType === selectedReturnType."
        }
      ]
    },
    {
      "id": "REQ-133",
      "summary": "Ensure GST Status refresh fetches and displays real filing-status data with clear English loading/empty/error states.",
      "acceptanceCriteria": [
        "Clicking the GST Status refresh action triggers a backend call that attempts to fetch real data from https://services.gst.gov.in/services/searchtp (not placeholder/dummy results).",
        "When data is returned, the UI shows rows with Period, Status (clearly indicating Filed/Not filed), and Filing Date (or an English placeholder like “Not available”).",
        "When the upstream request fails or returns an error condition, the backend returns a frontend-friendly error object (not a trap), and the UI displays a clear English error message without a blank screen.",
        "Loading state is shown while fetching; empty state is shown when the call succeeds but no entries are available for the selected filters."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the GST filing status query behavior to better match the “Show/Refresh Status” interaction model (e.g., prevent automatic fetch on first render when desired, ensure refetch always runs on button click, and ensure query keys reflect all selected filters)."
        },
        {
          "path": "frontend/src/pages/GstFilingStatusPage.tsx",
          "operation": "modify",
          "description": "Update the refresh action UX and table rendering: show an explicit loading state while fetching; render a clear English empty state when statusEntries for the selected return type are empty; render a clear English error state using getUserFacingError for thrown errors and a safe message for filingStatus.error without crashing; ensure table rows always show Period, Filed/Not filed status, and Filing Date (or “Not available”)."
        }
      ]
    },
    {
      "id": "REQ-134",
      "summary": "Render a more complete GST Profile section on GST Status using available fields and graceful English fallbacks.",
      "acceptanceCriteria": [
        "Backend GST filing-status response includes additional GST profile fields (beyond the current isActive/legalName/tradeName) when available from the GST portal response, and the frontend types/bindings compile without type hacks.",
        "GST Status page renders a “GST Profile” (or equivalent) section that displays the available profile fields and clearly indicates Active/Inactive/Unknown status.",
        "If profile fields are missing/unavailable, the UI degrades gracefully (does not crash) and shows sensible English placeholders (e.g., “Not available”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/gst/GstProfileSection.tsx",
          "operation": "create",
          "description": "Create a GST Profile section component that accepts the GSTFilingStatus object and renders available profile fields (e.g., gstin, gstStatus, legalName, tradeName, taxpayerType, state, address/principalPlaceOfBusiness, natureOfBusiness, registration/cancellation dates, filing frequency details) with English “Not available” fallbacks and Active/Inactive/Unknown badge handling using existing UI components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GstFilingStatusPage.tsx",
          "operation": "modify",
          "description": "Replace/extend the existing limited ‘GST Profile Status’ card by wiring in GstProfileSection and ensuring the page continues to render safely when any profile fields are missing/unavailable."
        }
      ]
    }
  ]
}