{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Invoice address overrides + print layout fixes (pagination, remove amount-in-words, restore back navigation)",
  "requirements": [
    {
      "id": "REQ-161",
      "summary": "Add editable per-invoice Bill To / Ship To address fields in the invoice editor and include them in save payloads.",
      "acceptanceCriteria": [
        "In the invoice editor (new + edit), the user can view and edit two address text fields labeled “Bill To Address” and “Ship To Address”.",
        "For a new invoice, both fields default to the selected customer’s billing address but remain user-editable.",
        "When the invoice is saved, the overridden addresses are persisted with the invoice (not only derived from the customer record).",
        "When editing an existing invoice, the previously saved Bill To / Ship To addresses are loaded and displayed in the editor.",
        "All user-facing labels/help text for these fields are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InvoiceEditorPage.tsx",
          "operation": "modify",
          "description": "Add two multiline, user-editable fields labeled “Bill To Address” and “Ship To Address”; default them from the selected customer’s billing address for new invoices (without overwriting user edits), and when editing load initial values from invoice.billToOverride/shipToOverride when present. Ensure the save logic includes these overrides when calling create/edit invoice mutations (mapping the text fields into the override object shape expected by the frontend backend typings)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the create/edit invoice mutation parameter objects to accept Bill To / Ship To override values from the editor, and pass them through to the backend actor method calls (using null when an override is not set/blank)."
        }
      ]
    },
    {
      "id": "REQ-162",
      "summary": "Show per-invoice Bill To / Ship To overrides in invoice detail and print views, with safe fallback to customer billing address.",
      "acceptanceCriteria": [
        "Invoice detail view shows the correct addresses based on invoice overrides when present.",
        "Invoice print layout shows “Bill To” and “Ship To” addresses using the invoice’s stored values when present.",
        "If an invoice does not have stored overrides (older invoices), the UI falls back to the customer billing address without crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InvoiceDetailPage.tsx",
          "operation": "modify",
          "description": "Update the customer/address section to display “Bill To Address” and “Ship To Address” derived from invoice.billToOverride/shipToOverride when present, otherwise fall back to customer.billingAddress. Keep labels in English and render as multiline where appropriate."
        },
        {
          "path": "frontend/src/pages/InvoicePrintPage.tsx",
          "operation": "modify",
          "description": "Update the “Bill To” and “Ship To” blocks to render invoice-level stored overrides when present, otherwise fall back to customer.billingAddress, ensuring older invoices (missing override fields) do not crash and still render correctly."
        }
      ]
    },
    {
      "id": "REQ-163",
      "summary": "Remove the “Total Invoice Amount in Words” section from the printed invoice layout.",
      "acceptanceCriteria": [
        "The invoice print page (frontend/src/pages/InvoicePrintPage.tsx) does not render the “Total Invoice Amount in Words” block.",
        "No empty space, border box, or placeholder remains where the removed section previously appeared.",
        "All other print sections (line items, GST breakdown, banking details when configured) still render correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InvoicePrintPage.tsx",
          "operation": "modify",
          "description": "Remove rendering of the “Total Invoice Amount in Words” section and any related imports/variables (e.g., amountInWordsINR usage) so the block no longer appears and does not leave layout gaps."
        }
      ]
    },
    {
      "id": "REQ-164",
      "summary": "Improve multi-page invoice print pagination so headers repeat and table rows avoid splitting across pages using print CSS.",
      "acceptanceCriteria": [
        "When printing an invoice with enough line items to span multiple pages, each page repeats the line-items table column headers (thead repeats).",
        "Printed pages do not show clipped borders or partially overlapped content at page breaks.",
        "Table rows are not split in a way that makes a single row unreadable (avoid breaking inside rows where feasible via print CSS).",
        "The changes use print CSS (e.g., in frontend/src/index.css and/or print-page scoped classes) and do not require any backend changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/add print CSS to support multi-page invoice printing: ensure thead repeats on subsequent pages (e.g., display: table-header-group for the print-page table thead), prefer avoiding breaks inside table rows/cells (break-inside/page-break-inside rules for tr), and refine existing broad page-break-inside rules so tables can paginate cleanly without clipped borders or overlapped content."
        },
        {
          "path": "frontend/src/pages/InvoicePrintPage.tsx",
          "operation": "modify",
          "description": "Add/adjust print-page scoped class names on the line-items table (and any key sections if needed) to align with the updated print CSS for repeating headers and preventing row splits, without redesigning the overall print layout."
        }
      ]
    },
    {
      "id": "REQ-165",
      "summary": "Add a reliable in-app back navigation path from the invoice print page and hide it during printing; optionally auto-navigate after print.",
      "acceptanceCriteria": [
        "The invoice print page provides a visible on-screen “Back” action (English label) that returns the user to a sensible page (e.g., the Invoice Detail page for the same invoice).",
        "The “Back” action is hidden during actual printing (print media) so it does not appear on paper/PDF.",
        "Optionally, the existing usePrintOnce hook’s onAfterPrint callback is used so that after closing the print dialog, the app can automatically navigate back (without breaking manual navigation).",
        "User does not get stuck on the print route after printing; navigation back works reliably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/InvoicePrintPage.tsx",
          "operation": "modify",
          "description": "Add a visible on-screen “Back” action that navigates to the corresponding invoice detail route, mark it as non-printable (e.g., using the existing .no-print convention and/or a button element already hidden by print CSS), and wire usePrintOnce({ onAfterPrint }) to optionally auto-navigate back after the print dialog closes while preserving manual Back behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure the print stylesheet hides the new Back action during print media (confirm .no-print and/or button hiding rules cover it) so it never appears in the printed/PDF output."
        }
      ]
    }
  ]
}