{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-10T19:09:34.490Z",
  "summary": "REQ-161 appears implemented end-to-end with new per-invoice Bill To/Ship To override fields in the backend Invoice type plus a migration that preserves existing invoices and initializes overrides to null, and the invoice editor shows/loads editable fields. REQ-164/165 have partial evidence via print CSS improvements and print flow changes (usePrintOnce + afterprint navigation), but some acceptance criteria cannot be confirmed from the truncated diffs. REQ-162/163 cannot be fully verified from the provided diff snippets (detail page + print page render portions are truncated). Several unrelated PWA/UX changes were introduced that were not requested.",
  "missing_requirements": [
    {
      "id": "REQ-162",
      "requirement": "Invoice detail view shows the correct Bill To / Ship To addresses based on per-invoice overrides when present (fallback to customer billing address when not).",
      "reason": "InvoiceDetailPage.tsx is truncated before any address rendering logic is visible, so there is no confirmable evidence that the detail view displays bill-to/ship-to using stored overrides with fallback for older invoices.",
      "evidence": [
        "frontend/src/pages/InvoiceDetailPage.tsx (truncated in diff summary)"
      ]
    },
    {
      "id": "REQ-162",
      "requirement": "Invoice print layout shows Bill To and Ship To addresses using the invoice’s stored override values when present, otherwise falls back to customer billing address without crashing.",
      "reason": "Print page shows a fallback selection, but it only uses `addressLine1` for the override addresses in the visible snippet; the actual rendered output is truncated, so it’s not verifiable that both Bill To/Ship To blocks display correctly and completely per requirements.",
      "evidence": [
        "frontend/src/pages/InvoicePrintPage.tsx (truncated in diff summary)"
      ]
    },
    {
      "id": "REQ-163",
      "requirement": "Remove the “Total Invoice Amount in Words” section from the invoice print/export layout so it no longer appears anywhere and leaves no empty placeholder.",
      "reason": "InvoicePrintPage.tsx output markup is truncated; the diff summary does not explicitly show removal of the 'Total Invoice Amount in Words' block or confirm no placeholder remains.",
      "evidence": [
        "frontend/src/pages/InvoicePrintPage.tsx (truncated in diff summary)"
      ]
    },
    {
      "id": "REQ-165",
      "requirement": "Invoice print page provides a visible on-screen “Back” action (hidden during printing) that returns to a sensible page.",
      "reason": "Print flow auto-navigates via `onAfterPrint`, but the rendered UI is truncated; while `ArrowLeft` and `Button` are imported, the diff does not show an actual on-screen 'Back' control being rendered with an English label and being hidden for print.",
      "evidence": [
        "frontend/src/pages/InvoicePrintPage.tsx (truncated in diff summary)",
        "frontend/src/index.css (print rule hides `button` elements globally)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added/expanded PWA support (manifest, service worker caching/offline behavior, iOS splash screens/meta tags, service worker registration).",
      "reason": "Not requested by any of REQ-161..REQ-165 and goes beyond the stated scope (invoice address overrides + print pagination + remove amount-in-words + back navigation).",
      "evidence": [
        "frontend-file-summaries.txt (frontend/index.html, frontend/public/manifest.webmanifest, frontend/public/sw.js, frontend/src/pwa/registerServiceWorker.ts)"
      ]
    },
    {
      "description": "Profile setup dialog change (use of showCloseButton prop).",
      "reason": "Not requested by the BuildRequest requirements.",
      "evidence": [
        "frontend-file-summaries.txt (frontend/src/components/ProfileSetupDialog.tsx)"
      ]
    },
    {
      "description": "Broad UI/feature enhancements unrelated to invoice print/address requirements (responsive tables, filters, additional error handling improvements).",
      "reason": "Not requested by REQ-161..REQ-165 and may be outside the targeted high-priority changes.",
      "evidence": [
        "frontend-file-summaries.txt (CustomersTable.tsx, ItemsTable.tsx, InvoicesPage.tsx, frontend/src/utils/userFacingError.ts)"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/hooks/usePrintOnce.ts",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/index.css",
    "frontend/src/pages/InvoiceDetailPage.tsx",
    "frontend/src/pages/InvoiceEditorPage.tsx",
    "frontend/src/pages/InvoicePrintPage.tsx",
    "project_state.json"
  ]
}